mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2c2xj/common/s6e2c2xj.h
typedef struct stc_ethernet_mac_rgsr_field
{
    union {
        struct {
            __IO  uint32_t  LM                   :1;
            __IO  uint32_t  LSP                  :2;
            __IO  uint32_t  LS                   :1;
            __IO  uint32_t  RESERVED1            :28;
        };
        struct {
            __IO  uint32_t  RESERVED0            :1;
            __IO  uint32_t  LSP0                 :1;
            __IO  uint32_t  LSP1                 :1;
            __IO  uint32_t  RESERVED2            :29;
        };
    };
} stc_ethernet_mac_rgsr_field_t;

typedef struct stc_ethernet_mac_mmc_cntl_field
{
    union {
        struct {
            __IO  uint32_t  B                    :6;
            __IO  uint32_t  RESERVED0            :26;
        };
        struct {
            __IO  uint32_t  B0                   :1;
            __IO  uint32_t  B1                   :1;
            __IO  uint32_t  B2                   :1;
            __IO  uint32_t  B3                   :1;
            __IO  uint32_t  B4                   :1;
            __IO  uint32_t  B5                   :1;
            __IO  uint32_t  RESERVED1            :26;
        };
    };
} stc_ethernet_mac_mmc_cntl_field_t;

typedef struct stc_ethernet_mac_mmc_intr_rx_field
{
    union {
        struct {
            __IO  uint32_t  B                    :24;
            __IO  uint32_t  RESERVED0            :8;
        };
        struct {
            __IO  uint32_t  B0                   :1;
            __IO  uint32_t  B1                   :1;
            __IO  uint32_t  B2                   :1;
            __IO  uint32_t  B3                   :1;
            __IO  uint32_t  B4                   :1;
            __IO  uint32_t  B5                   :1;
            __IO  uint32_t  B6                   :1;
            __IO  uint32_t  B7                   :1;
            __IO  uint32_t  B8                   :1;
            __IO  uint32_t  B9                   :1;
            __IO  uint32_t  B10                  :1;
            __IO  uint32_t  B11                  :1;
            __IO  uint32_t  B12                  :1;
            __IO  uint32_t  B13                  :1;
            __IO  uint32_t  B14                  :1;
            __IO  uint32_t  B15                  :1;
            __IO  uint32_t  B16                  :1;
            __IO  uint32_t  B17                  :1;
            __IO  uint32_t  B18                  :1;
            __IO  uint32_t  B19                  :1;
            __IO  uint32_t  B20                  :1;
            __IO  uint32_t  B21                  :1;
            __IO  uint32_t  B22                  :1;
            __IO  uint32_t  B23                  :1;
            __IO  uint32_t  RESERVED1            :8;
        };
    };
} stc_ethernet_mac_mmc_intr_rx_field_t;

typedef struct stc_ethernet_mac_mmc_intr_tx_field
{
    union {
        struct {
            __IO  uint32_t  B                    :25;
            __IO  uint32_t  RESERVED0            :7;
        };
        struct {
            __IO  uint32_t  B0                   :1;
            __IO  uint32_t  B1                   :1;
            __IO  uint32_t  B2                   :1;
            __IO  uint32_t  B3                   :1;
            __IO  uint32_t  B4                   :1;
            __IO  uint32_t  B5                   :1;
            __IO  uint32_t  B6                   :1;
            __IO  uint32_t  B7                   :1;
            __IO  uint32_t  B8                   :1;
            __IO  uint32_t  B9                   :1;
            __IO  uint32_t  B10                  :1;
            __IO  uint32_t  B11                  :1;
            __IO  uint32_t  B12                  :1;
            __IO  uint32_t  B13                  :1;
            __IO  uint32_t  B14                  :1;
            __IO  uint32_t  B15                  :1;
            __IO  uint32_t  B16                  :1;
            __IO  uint32_t  B17                  :1;
            __IO  uint32_t  B18                  :1;
            __IO  uint32_t  B19                  :1;
            __IO  uint32_t  B20                  :1;
            __IO  uint32_t  B21                  :1;
            __IO  uint32_t  B22                  :1;
            __IO  uint32_t  B23                  :1;
            __IO  uint32_t  B24                  :1;
            __IO  uint32_t  RESERVED1            :7;
        };
    };
} stc_ethernet_mac_mmc_intr_tx_field_t;

typedef struct stc_ethernet_mac_mmc_intr_mask_rx_field
{
    union {
        struct {
            __IO  uint32_t  B                    :24;
            __IO  uint32_t  RESERVED0            :8;
        };
        struct {
            __IO  uint32_t  B0                   :1;
            __IO  uint32_t  B1                   :1;
            __IO  uint32_t  B2                   :1;
            __IO  uint32_t  B3                   :1;
            __IO  uint32_t  B4                   :1;
            __IO  uint32_t  B5                   :1;
            __IO  uint32_t  B6                   :1;
            __IO  uint32_t  B7                   :1;
            __IO  uint32_t  B8                   :1;
            __IO  uint32_t  B9                   :1;
            __IO  uint32_t  B10                  :1;
            __IO  uint32_t  B11                  :1;
            __IO  uint32_t  B12                  :1;
            __IO  uint32_t  B13                  :1;
            __IO  uint32_t  B14                  :1;
            __IO  uint32_t  B15                  :1;
            __IO  uint32_t  B16                  :1;
            __IO  uint32_t  B17                  :1;
            __IO  uint32_t  B18                  :1;
            __IO  uint32_t  B19                  :1;
            __IO  uint32_t  B20                  :1;
            __IO  uint32_t  B21                  :1;
            __IO  uint32_t  B22                  :1;
            __IO  uint32_t  B23                  :1;
            __IO  uint32_t  RESERVED1            :8;
        };
    };
} stc_ethernet_mac_mmc_intr_mask_rx_field_t;

typedef struct stc_ethernet_mac_mmc_intr_mask_tx_field
{
    union {
        struct {
            __IO  uint32_t  B                    :25;
            __IO  uint32_t  RESERVED0            :7;
        };
        struct {
            __IO  uint32_t  B0                   :1;
            __IO  uint32_t  B1                   :1;
            __IO  uint32_t  B2                   :1;
            __IO  uint32_t  B3                   :1;
            __IO  uint32_t  B4                   :1;
            __IO  uint32_t  B5                   :1;
            __IO  uint32_t  B6                   :1;
            __IO  uint32_t  B7                   :1;
            __IO  uint32_t  B8                   :1;
            __IO  uint32_t  B9                   :1;
            __IO  uint32_t  B10                  :1;
            __IO  uint32_t  B11                  :1;
            __IO  uint32_t  B12                  :1;
            __IO  uint32_t  B13                  :1;
            __IO  uint32_t  B14                  :1;
            __IO  uint32_t  B15                  :1;
            __IO  uint32_t  B16                  :1;
            __IO  uint32_t  B17                  :1;
            __IO  uint32_t  B18                  :1;
            __IO  uint32_t  B19                  :1;
            __IO  uint32_t  B20                  :1;
            __IO  uint32_t  B21                  :1;
            __IO  uint32_t  B22                  :1;
            __IO  uint32_t  B23                  :1;
            __IO  uint32_t  B24                  :1;
            __IO  uint32_t  RESERVED1            :7;
        };
    };
} stc_ethernet_mac_mmc_intr_mask_tx_field_t;

