mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2c2xj/common/s6e2c2xj.h
#define FM_GPIO_PZR2                              *((volatile uint32_t*)(0x4006F708UL))
#define FM4_GPIO_PZR2                             *((volatile uint32_t*)(0x4006F708UL))
#define FM_GPIO_PZR3                              *((volatile uint32_t*)(0x4006F70CUL))
#define FM4_GPIO_PZR3                             *((volatile uint32_t*)(0x4006F70CUL))
#define FM_GPIO_PZR4                              *((volatile uint32_t*)(0x4006F710UL))
#define FM4_GPIO_PZR4                             *((volatile uint32_t*)(0x4006F710UL))
#define FM_GPIO_PZR5                              *((volatile uint32_t*)(0x4006F714UL))
#define FM4_GPIO_PZR5                             *((volatile uint32_t*)(0x4006F714UL))
#define FM_GPIO_PZR6                              *((volatile uint32_t*)(0x4006F718UL))
#define FM4_GPIO_PZR6                             *((volatile uint32_t*)(0x4006F718UL))
#define FM_GPIO_PZR7                              *((volatile uint32_t*)(0x4006F71CUL))
#define FM4_GPIO_PZR7                             *((volatile uint32_t*)(0x4006F71CUL))
#define FM_GPIO_PZR8                              *((volatile uint32_t*)(0x4006F720UL))
#define FM4_GPIO_PZR8                             *((volatile uint32_t*)(0x4006F720UL))
#define FM_GPIO_PZR9                              *((volatile uint32_t*)(0x4006F724UL))
#define FM4_GPIO_PZR9                             *((volatile uint32_t*)(0x4006F724UL))
#define FM_GPIO_PZRA                              *((volatile uint32_t*)(0x4006F728UL))
#define FM4_GPIO_PZRA                             *((volatile uint32_t*)(0x4006F728UL))
#define FM_GPIO_PZRB                              *((volatile uint32_t*)(0x4006F72CUL))
#define FM4_GPIO_PZRB                             *((volatile uint32_t*)(0x4006F72CUL))
#define FM_GPIO_PZRC                              *((volatile uint32_t*)(0x4006F730UL))
#define FM4_GPIO_PZRC                             *((volatile uint32_t*)(0x4006F730UL))
#define FM_GPIO_PZRD                              *((volatile uint32_t*)(0x4006F734UL))
#define FM4_GPIO_PZRD                             *((volatile uint32_t*)(0x4006F734UL))
#define FM_GPIO_PZRE                              *((volatile uint32_t*)(0x4006F738UL))
#define FM4_GPIO_PZRE                             *((volatile uint32_t*)(0x4006F738UL))
#define FM_GPIO_PZRF                              *((volatile uint32_t*)(0x4006F73CUL))
#define FM4_GPIO_PZRF                             *((volatile uint32_t*)(0x4006F73CUL))
#define FM_GPIO_PDSR0                             *((volatile uint32_t*)(0x4006F740UL))
#define FM4_GPIO_PDSR0                            *((volatile uint32_t*)(0x4006F740UL))
#define FM_GPIO_PDSR1                             *((volatile uint32_t*)(0x4006F744UL))
#define FM4_GPIO_PDSR1                            *((volatile uint32_t*)(0x4006F744UL))
#define FM_GPIO_PDSR2                             *((volatile uint32_t*)(0x4006F748UL))
#define FM4_GPIO_PDSR2                            *((volatile uint32_t*)(0x4006F748UL))
#define FM_GPIO_PDSR3                             *((volatile uint32_t*)(0x4006F74CUL))
#define FM4_GPIO_PDSR3                            *((volatile uint32_t*)(0x4006F74CUL))
#define FM_GPIO_PDSR4                             *((volatile uint32_t*)(0x4006F750UL))
#define FM4_GPIO_PDSR4                            *((volatile uint32_t*)(0x4006F750UL))
#define FM_GPIO_PDSR5                             *((volatile uint32_t*)(0x4006F754UL))
#define FM4_GPIO_PDSR5                            *((volatile uint32_t*)(0x4006F754UL))
#define FM_GPIO_PDSR6                             *((volatile uint32_t*)(0x4006F758UL))
#define FM4_GPIO_PDSR6                            *((volatile uint32_t*)(0x4006F758UL))
#define FM_GPIO_PDSR7                             *((volatile uint32_t*)(0x4006F75CUL))
#define FM4_GPIO_PDSR7                            *((volatile uint32_t*)(0x4006F75CUL))
#define FM_GPIO_PDSR8                             *((volatile uint32_t*)(0x4006F760UL))
#define FM4_GPIO_PDSR8                            *((volatile uint32_t*)(0x4006F760UL))
#define FM_GPIO_PDSR9                             *((volatile uint32_t*)(0x4006F764UL))
#define FM4_GPIO_PDSR9                            *((volatile uint32_t*)(0x4006F764UL))
#define FM_GPIO_PDSRA                             *((volatile uint32_t*)(0x4006F768UL))
#define FM4_GPIO_PDSRA                            *((volatile uint32_t*)(0x4006F768UL))
#define FM_GPIO_PDSRB                             *((volatile uint32_t*)(0x4006F76CUL))
#define FM4_GPIO_PDSRB                            *((volatile uint32_t*)(0x4006F76CUL))
#define FM_GPIO_PDSRC                             *((volatile uint32_t*)(0x4006F770UL))
#define FM4_GPIO_PDSRC                            *((volatile uint32_t*)(0x4006F770UL))
#define FM_GPIO_PDSRD                             *((volatile uint32_t*)(0x4006F774UL))
#define FM4_GPIO_PDSRD                            *((volatile uint32_t*)(0x4006F774UL))
#define FM_GPIO_PDSRE                             *((volatile uint32_t*)(0x4006F778UL))
#define FM4_GPIO_PDSRE                            *((volatile uint32_t*)(0x4006F778UL))
#define FM_GPIO_PDSRF                             *((volatile uint32_t*)(0x4006F77CUL))
#define FM4_GPIO_PDSRF                            *((volatile uint32_t*)(0x4006F77CUL))

/*******************************************************************************
* HSSPI Registers HSSPI
*   Register Definition
*******************************************************************************/
#define FM_HSSPI_MCTRL                            *((volatile uint32_t*)(0xD0000000UL))
#define FM4_HSSPI_MCTRL                           *((volatile uint32_t*)(0xD0000000UL))
#define FM_HSSPI_PCC0                             *((volatile uint32_t*)(0xD0000004UL))
#define FM4_HSSPI_PCC0                            *((volatile uint32_t*)(0xD0000004UL))
#define FM_HSSPI_PCC1                             *((volatile uint32_t*)(0xD0000008UL))
#define FM4_HSSPI_PCC1                            *((volatile uint32_t*)(0xD0000008UL))
#define FM_HSSPI_PCC2                             *((volatile uint32_t*)(0xD000000CUL))
#define FM4_HSSPI_PCC2                            *((volatile uint32_t*)(0xD000000CUL))
#define FM_HSSPI_PCC3                             *((volatile uint32_t*)(0xD0000010UL))
#define FM4_HSSPI_PCC3                            *((volatile uint32_t*)(0xD0000010UL))
#define FM_HSSPI_TXF                              *((volatile uint32_t*)(0xD0000014UL))
#define FM4_HSSPI_TXF                             *((volatile uint32_t*)(0xD0000014UL))
#define FM_HSSPI_TXE                              *((volatile uint32_t*)(0xD0000018UL))
#define FM4_HSSPI_TXE                             *((volatile uint32_t*)(0xD0000018UL))
#define FM_HSSPI_TXC                              *((volatile uint32_t*)(0xD000001CUL))
#define FM4_HSSPI_TXC                             *((volatile uint32_t*)(0xD000001CUL))
#define FM_HSSPI_RXF                              *((volatile uint32_t*)(0xD0000020UL))
#define FM4_HSSPI_RXF                             *((volatile uint32_t*)(0xD0000020UL))
#define FM_HSSPI_RXE                              *((volatile uint32_t*)(0xD0000024UL))
#define FM4_HSSPI_RXE                             *((volatile uint32_t*)(0xD0000024UL))
#define FM_HSSPI_RXC                              *((volatile uint32_t*)(0xD0000028UL))
#define FM4_HSSPI_RXC                             *((volatile uint32_t*)(0xD0000028UL))
#define FM_HSSPI_FAULTF                           *((volatile uint32_t*)(0xD000002CUL))
#define FM4_HSSPI_FAULTF                          *((volatile uint32_t*)(0xD000002CUL))
#define FM_HSSPI_FAULTC                           *((volatile uint32_t*)(0xD0000030UL))
#define FM4_HSSPI_FAULTC                          *((volatile uint32_t*)(0xD0000030UL))
#define FM_HSSPI_DMCFG                            *((volatile  uint8_t*)(0xD0000034UL))
#define FM4_HSSPI_DMCFG                           *((volatile  uint8_t*)(0xD0000034UL))
#define FM_HSSPI_DMDMAEN                          *((volatile  uint8_t*)(0xD0000035UL))
#define FM4_HSSPI_DMDMAEN                         *((volatile  uint8_t*)(0xD0000035UL))
#define FM_HSSPI_DMSTART                          *((volatile  uint8_t*)(0xD0000038UL))
#define FM4_HSSPI_DMSTART                         *((volatile  uint8_t*)(0xD0000038UL))
#define FM_HSSPI_DMSTOP                           *((volatile  uint8_t*)(0xD0000039UL))
#define FM4_HSSPI_DMSTOP                          *((volatile  uint8_t*)(0xD0000039UL))
#define FM_HSSPI_DMPSEL                           *((volatile  uint8_t*)(0xD000003AUL))
#define FM4_HSSPI_DMPSEL                          *((volatile  uint8_t*)(0xD000003AUL))
#define FM_HSSPI_DMTRP                            *((volatile  uint8_t*)(0xD000003BUL))
#define FM4_HSSPI_DMTRP                           *((volatile  uint8_t*)(0xD000003BUL))
#define FM_HSSPI_DMBCC                            *((volatile uint16_t*)(0xD000003CUL))
#define FM4_HSSPI_DMBCC                           *((volatile uint16_t*)(0xD000003CUL))
#define FM_HSSPI_DMBCS                            *((volatile uint16_t*)(0xD000003EUL))
#define FM4_HSSPI_DMBCS                           *((volatile uint16_t*)(0xD000003EUL))
#define FM_HSSPI_DMSTATUS                         *((volatile uint32_t*)(0xD0000040UL))
#define FM4_HSSPI_DMSTATUS                        *((volatile uint32_t*)(0xD0000040UL))
#define FM_HSSPI_FIFOCFG                          *((volatile uint32_t*)(0xD000004CUL))
#define FM4_HSSPI_FIFOCFG                         *((volatile uint32_t*)(0xD000004CUL))
#define FM_HSSPI_TXFIFO0                          *((volatile uint32_t*)(0xD0000050UL))
#define FM4_HSSPI_TXFIFO0                         *((volatile uint32_t*)(0xD0000050UL))
#define FM_HSSPI_TXFIFO1                          *((volatile uint32_t*)(0xD0000054UL))
#define FM4_HSSPI_TXFIFO1                         *((volatile uint32_t*)(0xD0000054UL))
#define FM_HSSPI_TXFIFO2                          *((volatile uint32_t*)(0xD0000058UL))
#define FM4_HSSPI_TXFIFO2                         *((volatile uint32_t*)(0xD0000058UL))
#define FM_HSSPI_TXFIFO3                          *((volatile uint32_t*)(0xD000005CUL))
#define FM4_HSSPI_TXFIFO3                         *((volatile uint32_t*)(0xD000005CUL))
#define FM_HSSPI_TXFIFO4                          *((volatile uint32_t*)(0xD0000060UL))
#define FM4_HSSPI_TXFIFO4                         *((volatile uint32_t*)(0xD0000060UL))
#define FM_HSSPI_TXFIFO5                          *((volatile uint32_t*)(0xD0000064UL))
#define FM4_HSSPI_TXFIFO5                         *((volatile uint32_t*)(0xD0000064UL))
#define FM_HSSPI_TXFIFO6                          *((volatile uint32_t*)(0xD0000068UL))
#define FM4_HSSPI_TXFIFO6                         *((volatile uint32_t*)(0xD0000068UL))
#define FM_HSSPI_TXFIFO7                          *((volatile uint32_t*)(0xD000006CUL))
#define FM4_HSSPI_TXFIFO7                         *((volatile uint32_t*)(0xD000006CUL))
#define FM_HSSPI_TXFIFO8                          *((volatile uint32_t*)(0xD0000070UL))
#define FM4_HSSPI_TXFIFO8                         *((volatile uint32_t*)(0xD0000070UL))
#define FM_HSSPI_TXFIFO9                          *((volatile uint32_t*)(0xD0000074UL))
#define FM4_HSSPI_TXFIFO9                         *((volatile uint32_t*)(0xD0000074UL))
#define FM_HSSPI_TXFIFO10                         *((volatile uint32_t*)(0xD0000078UL))
#define FM4_HSSPI_TXFIFO10                        *((volatile uint32_t*)(0xD0000078UL))
#define FM_HSSPI_TXFIFO11                         *((volatile uint32_t*)(0xD000007CUL))
#define FM4_HSSPI_TXFIFO11                        *((volatile uint32_t*)(0xD000007CUL))
#define FM_HSSPI_TXFIFO12                         *((volatile uint32_t*)(0xD0000080UL))
#define FM4_HSSPI_TXFIFO12                        *((volatile uint32_t*)(0xD0000080UL))
#define FM_HSSPI_TXFIFO13                         *((volatile uint32_t*)(0xD0000084UL))
#define FM4_HSSPI_TXFIFO13                        *((volatile uint32_t*)(0xD0000084UL))
#define FM_HSSPI_TXFIFO14                         *((volatile uint32_t*)(0xD0000088UL))
#define FM4_HSSPI_TXFIFO14                        *((volatile uint32_t*)(0xD0000088UL))
#define FM_HSSPI_TXFIFO15                         *((volatile uint32_t*)(0xD000008CUL))
#define FM4_HSSPI_TXFIFO15                        *((volatile uint32_t*)(0xD000008CUL))
#define FM_HSSPI_RXFIFO0                          *((volatile uint32_t*)(0xD0000090UL))
#define FM4_HSSPI_RXFIFO0                         *((volatile uint32_t*)(0xD0000090UL))
#define FM_HSSPI_RXFIFO1                          *((volatile uint32_t*)(0xD0000094UL))
#define FM4_HSSPI_RXFIFO1                         *((volatile uint32_t*)(0xD0000094UL))
#define FM_HSSPI_RXFIFO2                          *((volatile uint32_t*)(0xD0000098UL))
#define FM4_HSSPI_RXFIFO2                         *((volatile uint32_t*)(0xD0000098UL))
#define FM_HSSPI_RXFIFO3                          *((volatile uint32_t*)(0xD000009CUL))
#define FM4_HSSPI_RXFIFO3                         *((volatile uint32_t*)(0xD000009CUL))
#define FM_HSSPI_RXFIFO4                          *((volatile uint32_t*)(0xD00000A0UL))
#define FM4_HSSPI_RXFIFO4                         *((volatile uint32_t*)(0xD00000A0UL))
#define FM_HSSPI_RXFIFO5                          *((volatile uint32_t*)(0xD00000A4UL))
#define FM4_HSSPI_RXFIFO5                         *((volatile uint32_t*)(0xD00000A4UL))
#define FM_HSSPI_RXFIFO6                          *((volatile uint32_t*)(0xD00000A8UL))
#define FM4_HSSPI_RXFIFO6                         *((volatile uint32_t*)(0xD00000A8UL))
#define FM_HSSPI_RXFIFO7                          *((volatile uint32_t*)(0xD00000ACUL))
#define FM4_HSSPI_RXFIFO7                         *((volatile uint32_t*)(0xD00000ACUL))
#define FM_HSSPI_RXFIFO8                          *((volatile uint32_t*)(0xD00000B0UL))
#define FM4_HSSPI_RXFIFO8                         *((volatile uint32_t*)(0xD00000B0UL))
#define FM_HSSPI_RXFIFO9                          *((volatile uint32_t*)(0xD00000B4UL))
#define FM4_HSSPI_RXFIFO9                         *((volatile uint32_t*)(0xD00000B4UL))
#define FM_HSSPI_RXFIFO10                         *((volatile uint32_t*)(0xD00000B8UL))
#define FM4_HSSPI_RXFIFO10                        *((volatile uint32_t*)(0xD00000B8UL))
#define FM_HSSPI_RXFIFO11                         *((volatile uint32_t*)(0xD00000BCUL))
#define FM4_HSSPI_RXFIFO11                        *((volatile uint32_t*)(0xD00000BCUL))
#define FM_HSSPI_RXFIFO12                         *((volatile uint32_t*)(0xD00000C0UL))
#define FM4_HSSPI_RXFIFO12                        *((volatile uint32_t*)(0xD00000C0UL))
#define FM_HSSPI_RXFIFO13                         *((volatile uint32_t*)(0xD00000C4UL))
#define FM4_HSSPI_RXFIFO13                        *((volatile uint32_t*)(0xD00000C4UL))
#define FM_HSSPI_RXFIFO14                         *((volatile uint32_t*)(0xD00000C8UL))
#define FM4_HSSPI_RXFIFO14                        *((volatile uint32_t*)(0xD00000C8UL))
#define FM_HSSPI_RXFIFO15                         *((volatile uint32_t*)(0xD00000CCUL))
#define FM4_HSSPI_RXFIFO15                        *((volatile uint32_t*)(0xD00000CCUL))
#define FM_HSSPI_CSCFG                            *((volatile uint32_t*)(0xD00000D0UL))
#define FM4_HSSPI_CSCFG                           *((volatile uint32_t*)(0xD00000D0UL))
#define FM_HSSPI_CSITIME                          *((volatile uint32_t*)(0xD00000D4UL))
#define FM4_HSSPI_CSITIME                         *((volatile uint32_t*)(0xD00000D4UL))
#define FM_HSSPI_CSAEXT                           *((volatile uint32_t*)(0xD00000D8UL))
#define FM4_HSSPI_CSAEXT                          *((volatile uint32_t*)(0xD00000D8UL))
#define FM_HSSPI_RDCSDC0                          *((volatile uint16_t*)(0xD00000DCUL))
#define FM4_HSSPI_RDCSDC0                         *((volatile uint16_t*)(0xD00000DCUL))
#define FM_HSSPI_RDCSDC1                          *((volatile uint16_t*)(0xD00000DEUL))
#define FM4_HSSPI_RDCSDC1                         *((volatile uint16_t*)(0xD00000DEUL))
#define FM_HSSPI_RDCSDC2                          *((volatile uint16_t*)(0xD00000E0UL))
#define FM4_HSSPI_RDCSDC2                         *((volatile uint16_t*)(0xD00000E0UL))
#define FM_HSSPI_RDCSDC3                          *((volatile uint16_t*)(0xD00000E2UL))
#define FM4_HSSPI_RDCSDC3                         *((volatile uint16_t*)(0xD00000E2UL))
#define FM_HSSPI_RDCSDC4                          *((volatile uint16_t*)(0xD00000E4UL))
#define FM4_HSSPI_RDCSDC4                         *((volatile uint16_t*)(0xD00000E4UL))
#define FM_HSSPI_RDCSDC5                          *((volatile uint16_t*)(0xD00000E6UL))
#define FM4_HSSPI_RDCSDC5                         *((volatile uint16_t*)(0xD00000E6UL))
#define FM_HSSPI_RDCSDC6                          *((volatile uint16_t*)(0xD00000E8UL))
#define FM4_HSSPI_RDCSDC6                         *((volatile uint16_t*)(0xD00000E8UL))
#define FM_HSSPI_RDCSDC7                          *((volatile uint16_t*)(0xD00000EAUL))
#define FM4_HSSPI_RDCSDC7                         *((volatile uint16_t*)(0xD00000EAUL))
#define FM_HSSPI_WRCSDC0                          *((volatile uint16_t*)(0xD00000ECUL))
#define FM4_HSSPI_WRCSDC0                         *((volatile uint16_t*)(0xD00000ECUL))
#define FM_HSSPI_WRCSDC1                          *((volatile uint16_t*)(0xD00000EEUL))
#define FM4_HSSPI_WRCSDC1                         *((volatile uint16_t*)(0xD00000EEUL))
#define FM_HSSPI_WRCSDC2                          *((volatile uint16_t*)(0xD00000F0UL))
#define FM4_HSSPI_WRCSDC2                         *((volatile uint16_t*)(0xD00000F0UL))
#define FM_HSSPI_WRCSDC3                          *((volatile uint16_t*)(0xD00000F2UL))
#define FM4_HSSPI_WRCSDC3                         *((volatile uint16_t*)(0xD00000F2UL))
#define FM_HSSPI_WRCSDC4                          *((volatile uint16_t*)(0xD00000F4UL))
#define FM4_HSSPI_WRCSDC4                         *((volatile uint16_t*)(0xD00000F4UL))
#define FM_HSSPI_WRCSDC5                          *((volatile uint16_t*)(0xD00000F6UL))
#define FM4_HSSPI_WRCSDC5                         *((volatile uint16_t*)(0xD00000F6UL))
#define FM_HSSPI_WRCSDC6                          *((volatile uint16_t*)(0xD00000F8UL))
#define FM4_HSSPI_WRCSDC6                         *((volatile uint16_t*)(0xD00000F8UL))
#define FM_HSSPI_WRCSDC7                          *((volatile uint16_t*)(0xD00000FAUL))
#define FM4_HSSPI_WRCSDC7                         *((volatile uint16_t*)(0xD00000FAUL))
#define FM_HSSPI_MID                              *((volatile uint32_t*)(0xD00000FCUL))
#define FM4_HSSPI_MID                             *((volatile uint32_t*)(0xD00000FCUL))
#define FM_HSSPI_QDCLKR                           *((volatile  uint8_t*)(0xD0000400UL))
#define FM4_HSSPI_QDCLKR                          *((volatile  uint8_t*)(0xD0000400UL))
#define FM_HSSPI_DBCNT                            *((volatile  uint8_t*)(0xD0000404UL))
#define FM4_HSSPI_DBCNT                           *((volatile  uint8_t*)(0xD0000404UL))

